Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Compiling fully static binaries is done by statically linking https://musl.libc.org/[musl] instead of `glibc` and should not be used in production without rigorous testing.
ja_jp: 完全な静的バイナリのコンパイルは、 `glibc` の代わりに link:https://musl.libc.org/[musl] を静的にリンクすることで行われます。厳密なテストなしに実運用で使用するべきではありません。

source: Compiling the application to a native executable
ja_jp: アプリケーションをネイティブ実行可能ファイルにコンパイル

source: Complete `//TODO` sections in your code
ja_jp: コード内の `//TODO` セクションの補完

source: Complete example is located in the `security-openid-connect-websockets-next-quickstart` link:{quickstarts-tree-url}/security-openid-connect-websockets-next-quickstart[directory].
ja_jp: 完全な例は、`security-openid-connect-websockets-next-quickstart` link:{quickstarts-tree-url}/security-openid-connect-websockets-next-quickstart[ディレクトリー] にあります。

source: Complete the integration testing of your application in JVM and native modes by using xref:dev-services.adoc#databases[Dev Services for PostgreSQL] before you run your application in production mode.
ja_jp: アプリケーションを本番モードで実行する前に、xref:dev-services.adoc#databases[Dev Services for PostgreSQL] を使用して、JVM モードとネイティブモードでアプリケーションの結合テストを完了します。

source: Complete the steps in the xref:security-getting-started-tutorial.adoc[Getting started with Security by using Basic authentication and Jakarta Persistence] tutorial.
ja_jp: xref:security-getting-started-tutorial.adoc[Basic 認証と Jakarta Persistence を使ったセキュリティー入門] チュートリアルの手順を完了してください。

source: Completely customized per method serialization
ja_jp: メソッドごとに完全にカスタマイズされたシリアル化

source: Completely customized per method serialization/deserialization
ja_jp: メソッドごとに完全にカスタマイズされたシリアル化/デシリアル化

source: Completion for Qute Value Resolvers
ja_jp: Qute Value Resolversの補完

source: Completion improvements
ja_jp: 完成度の向上

source: Completion redux
ja_jp: 完成の再現

source: Completions too !
ja_jp: コード補完もあります！

source: Complex filtering to list entities using @NamedQuery
ja_jp: @NamedQueryを使った複雑なフィルタリングによるエンティティのリスト化

source: Components
ja_jp: コンポーネント

source: Compose Dev Services automatically exposes the configuration of discovered services to your application. For example, when a database service is discovered with the following compose service description:
ja_jp: Compose Dev Services は、検出されたサービスの構成をアプリケーションに自動的に公開します。たとえば、次の compose サービス記述でデータベースサービスが検出された場合:

source: Compose Dev Services determines the project name as follows:
ja_jp: Compose Dev Services は、次のようにプロジェクト名を決定します。

source: Compose Dev Services is only compatible with Compose V2.
ja_jp: Compose Dev Services は Compose V2 のみと互換性があります。

source: Compose Dev Services offer a way to define custom dev services using the Compose specification.
ja_jp: Compose Dev Services は、Compose 仕様を使用してカスタム dev services を定義する方法を提供します。

source: Compose Dev Services provides several configuration options to control how services are started, stopped and shared between application instances.
ja_jp: Compose Dev Services は、サービスの起動、停止、およびアプリケーションインスタンス間での共有方法を制御するためのいくつかの設定オプションを提供します。

source: Compose Dev Services provides several ways to ensure services are ready before your application tries to use them.
ja_jp: Compose Dev Services は、アプリケーションがサービスを使用しようとする前に、サービスが準備完了であることを確認するためのいくつかの方法を提供します。

source: Compose Dev Services respects the health checks defined in your Compose file. It's recommended to configure health checks for your services to ensure they are ready before your application tries to use them:
ja_jp: Compose Dev Services は、Compose ファイルで定義されたヘルスチェックを尊重します。アプリケーションがサービスを使用しようとする前に、サービスが準備完了であることを確認するために、サービスのヘルスチェックを設定することをお勧めします:

source: Compose Dev Services starts services in the order they are defined in the Compose file. If you need to start services in a specific order, you can use the `depends_on` attribute:
ja_jp: Compose Dev Services は、Compose ファイルで定義されている順序でサービスを起動します。特定の順序でサービスを起動する必要がある場合は、 `depends_on` 属性を使用できます:

source: Compose Dev Services used for tests
ja_jp: テストに使用される Compose Dev Services

source: Compose Dev Services work alongside existing Dev Services implementations provided by Quarkus extensions. The service discovery process follows this order of precedence:
ja_jp: Compose Dev Services は、Quarkus エクステンションによって提供される既存の Dev Services の実装と連携して動作します。サービス検出プロセスは次の優先順位に従います。

source: Compose Project Name
ja_jp: Compose プロジェクト名

source: Compose is a widely used tool for defining and managing multi-container applications, for development and testing purposes. A YAML description file, typically named `compose.yml`, defines the services, networks, and volumes required for your application. https://docs.docker.com/compose/[Docker Compose] is the reference implementation and https://podman-desktop.io/docs/compose[Podman Desktop] also provides out-of-the-box support for the Compose specification.
ja_jp: Compose は、開発およびテスト目的でマルチコンテナーアプリケーションを定義および管理するために広く使用されているツールです。 通常 `compose.yml` という名前の YAML 記述ファイルは、アプリケーションに必要なサービス、ネットワーク、およびボリュームを定義します。 https://docs.docker.com/compose/[Docker Compose] はリファレンス実装であり、 https://podman-desktop.io/docs/compose[Podman Desktop] も Compose specification のすぐに使えるサポートを提供します。

source: Compose tooling such as `docker-compose` or `podman-compose` (Note that `docker compose` and `podman compose` commands internally call these binaries):
ja_jp: `docker-compose` または `podman-compose` のような Compose ツール ( `docker compose` および `podman compose` コマンドは内部でこれらのバイナリを呼び出すことに注意してください):

source: Compose uses the project name to identify resources such as services, networks, volumes, etc. in order to namespace and isolate different compose projects. This enables the discovery of existing resources and cleanup resources when the application stops.
ja_jp: Compose は、異なる Compose プロジェクトを名前空間化して分離するために、サービス、ネットワーク、ボリュームなどのリソースを識別するためにプロジェクト名を使用します。これにより、アプリケーションが停止したときに、既存のリソースの検出とリソースのクリーンアップが可能になります。

source: Composite cache key building logic
ja_jp: 複合キャッシュキー構築ロジック

source: Composite provider properties
ja_jp: 複合プロバイダープロパティー

source: Comprehensive Observability
ja_jp: 包括的な可観測性

source: Compress Native Executables with UPX
ja_jp: UPXでネイティブ実行可能ファイルを圧縮

source: Compress native images
ja_jp: ネイティブイメージの圧縮

source: Compressing native executables using UPX
ja_jp: UPXでネイティブ実行可能ファイルを圧縮

source: Compressing native executables with UPX
ja_jp: UPXによる圧縮されたネイティブ実行可能ファイルのビルド

source: Compression can be explicitly en-/disabled by setting `quarkus.native.compression.enabled`.
ja_jp: `quarkus.native.compression.enabled` を設定することで、圧縮を明示的に有効/無効にできます。

source: Compression handler.
ja_jp: 圧縮ハンドラ。

source: Compression level
ja_jp: 圧縮レベル

source: Compression support for Reactive Routes and RESTEasy Reactive
ja_jp: Reactive RoutesとRESTEasy Reactiveにおける圧縮サポート

source: Compute the sum of `RowSet#rowCount`.
ja_jp: `RowSet#rowCount` の合計を計算します。

source: Computing the class list
ja_jp: クラスリストの計算

source: Concept
ja_jp: コンセプト

source: Concept documents should end in `-concept.adoc`
ja_jp: コンセプトドキュメントは `-concept.adoc` で終わる必要があります。

source: Concept documents should end in `-concepts.adoc`
ja_jp: コンセプトドキュメントは `-concepts.adoc` で終わる必要があります。

source: Concept guides (Explanation)
ja_jp: コンセプトガイド (説明)

source: Concepts
ja_jp: コンセプト

source: Concerning dev mode
ja_jp: devモードについて

source: Conclusion
ja_jp: まとめ

source: Conclusion and additional resources
ja_jp: 結論と関連情報

source: Concurrent Execution
ja_jp: 同時実行

source: Concurrent executions are skipped.
ja_jp: 同時実行はスキップされます。

source: Concurrent requests
ja_jp: 同時リクエスト

source: Concurrent stream element processing
ja_jp: 同時ストリーム要素処理

source: Conditional Dependencies
ja_jp: 条件付き依存関係

source: Conditional Execution
ja_jp: 条件付き実行

source: Conditional Extension Dependencies
ja_jp: 条件付きエクステンション依存関係

source: Conditional Quarkus Extension Dependencies
ja_jp: 条件付き Quarkus エクステンションの依存関係

source: Conditional Step Inclusion
ja_jp: 条件付きステップを含める

source: Conditional capability promises and requirements
ja_jp: 条件付ケイパビリティ約束と要件

source: Conditional dependencies can also be configured in the Quarkus extension descriptor directly. Here is an example of how it can be done in the Quarkus extension plugin configuration of the `quarkus-extension-a`:
ja_jp: 条件付き依存関係は、Quarkus エクステンションの記述子で直接設定することもできます。以下は、 `quarkus-extension-a` の Quarkus 拡張プラグイン設定でこれを行う方法の例です。

source: Conditional dependencies can also be configured in the Quarkus extension descriptor. The conditional dependency configured above could be expressed in the extension descriptor of `quarkus-extension-a` as:
ja_jp: 条件付きの依存関係は、Quarkusのエクステンション記述子でも設定できます。上記で設定した条件付き依存関係は、 `quarkus-extension-a` のエクステンション記述子で次のように表現できます。

source: Conditionally configure channels
ja_jp: 条件付きでチャンネルを設定する

source: Config
ja_jp: 設定

source: Config Interceptors
ja_jp: 設定インターセプター

source: Config Phases
ja_jp: 設定フェーズ

source: Config Property Example
ja_jp: 設定プロパティーの例

source: Config Recording
ja_jp: 設定の記録

source: Config Sources
ja_jp: 設定ソース

source: Config autocompletion
ja_jp: 設定の自動補完

source: Config editor
ja_jp: 設定エディタ

source: Config file
ja_jp: 設定ファイル

source: Config group arrays
ja_jp: コンフィググループ配列

source: Config jump to definition
ja_jp: 設定の定義へのジャンプ

source: Config outline
ja_jp: 設定アウトライン

source: Config profiles
ja_jp: 設定プロファイル

source: Config properties which are set for a specific document are applied only for this specific document, i.e. the OpenAPI document served at `/q/openapi-<document-name>`.
ja_jp: 特定のドキュメント用に指定された設定プロパティーは、その特定のドキュメント、つまり `/q/openapi-<document-name>` で提供される OpenAPI ドキュメントにのみ適用されます。

source: Config properties which are set for the default document are applied only for the default document, i.e. the OpenAPI document served at `/q/openapi`.
ja_jp: デフォルトドキュメント用に指定された設定プロパティーは、デフォルトドキュメント、つまり `/q/openapi` で提供される OpenAPI ドキュメントにのみ適用されます。

source: Config property allows for a specified external or internal location of the Private Decryption Key.
ja_jp: Config プロパティーを使用すると、秘密復号化キーの外部または内部の場所を指定できます。

source: Config property allows for a specified external or internal location of the public key. The value can be a relative path or a URL. If the value points to an HTTPS-based JWK set, then, for it to work in native mode, the `quarkus.ssl.native` property must also be set to `true`. See xref:native-and-ssl.adoc[Using SSL With Native Executables] for more details.
ja_jp: Config プロパティーでは、公開鍵の外部または内部の場所を指定できます。値は、相対パスまたは URL を使用できます。値が HTTPS ベースの JWK セットを指している場合、ネイティブモードで動作させるには、 `quarkus.ssl.native` プロパティーも `true` に設定する必要があります。詳細は、xref:native-and-ssl.adoc[ネイティブ実行可能ファイルでの SSL の使用] を参照してください。

source: Config property allows for an external or internal location of Private Decryption Key to be specified.
ja_jp: Config プロパティーを使用すると、秘密復号化鍵の外部または内部の場所を指定できます。

source: Config property allows for an external or internal location of Private Decryption Key to be specified. This property is deprecated - use 'mp.jwt.decrypt.key.location'.
ja_jp: Config プロパティーを使用すると、秘密復号化鍵の外部または内部の場所を指定できます。このプロパティーは推奨されません。'mp.jwt.decrypt.key.location' を使用してください。

source: Config property allows for an external or internal location of Private Decryption Key to be specified. This property is deprecated - use `mp.jwt.decrypt.key.location`.
ja_jp: 設定プロパティでは、秘密復号鍵の外部または内部の場所を指定できます。このプロパティは非推奨です。 `mp.jwt.decrypt.key.location` を使用してください。

source: Config property allows for an external or internal location of Public Key to be specified. The value may be a relative path or a URL. If the value points to an HTTPS based JWK set then, for it to work in native mode, the `quarkus.ssl.native` property must also be set to `true`, see xref:native-and-ssl.adoc[Using SSL With Native Executables] for more details.
ja_jp: Config プロパティーを使用すると、公開鍵の外部または内部の場所を指定できます。値は相対パスまたは URL の場合があります。値が HTTPS ベースの JWK セットを指している場合、ネイティブモードで機能するには、 `quarkus.ssl.native` プロパティーも `true` に設定する必要があります。詳細については xref:native-and-ssl.adoc[ネイティブ実行可能ファイルで SSL を使用する場合] を参照してください。

source: Config property specifies the value of the `iss` (issuer) claim of the JWT that the server accepts as valid.
ja_jp: Config プロパティーは、サーバーが有効として受け入れる JWT の `iss` (発行者) クレームの値を指定します。

source: Config property specifies the value of the `iss` (issuer) claim of the JWT that the server will accept as valid.
ja_jp: Config プロパティーは、サーバーが有効として受け入れる JWT の `iss` (発行者) クレームの値を指定します。

source: Config property to specify the external or internal location of Private Decryption Key. This property is deprecated - use `mp.jwt.decrypt.key.location`.
ja_jp: 秘密復号鍵の外部または内部の場所を指定するための設定プロパティー。このプロパティーは非推奨です。 `mp.jwt.decrypt.key.location` を使用してください。

source: Config property values injected during static initialization phase
ja_jp: 静的初期化フェーズで注入される設定プロパティ値

source: Config sources
ja_jp: 設定ソース

source: Config validation
ja_jp: 設定の検証

source: Config which is only known after the service is started can be passed in using a `configProvider()`
ja_jp: サービスの開始後にのみ判明する設定は、 `configProvider()` を使用して渡すことができます。

source: ConfigMap volumes
ja_jp: ConfigMap Volume

source: ConfigMaps and Secrets created from files named `application.properties`, `application.yaml` or `application.yml` (see https://kubernetes.io/docs/tasks/configure-pod-container/configure-pod-configmap/#create-configmaps-from-files[this] for an example on how to create one).
ja_jp: ConfigMapsとSecretsは、 `application.properties` 、 `application.yaml` 、または `application.yml` という名前のファイルから作成されます(作成方法の例は link:https://kubernetes.io/docs/tasks/configure-pod-container/configure-pod-configmap/#create-configmaps-from-files[こちら] を参照してください)。

source: ConfigMaps and Secrets that contain literal data (see https://kubernetes.io/docs/tasks/configure-pod-container/configure-pod-configmap/#create-configmaps-from-literal-values[this] for an example on how to create one)
ja_jp: リテラルデータを含む ConfigMaps と Secrets (作成方法の例は link:https://kubernetes.io/docs/tasks/configure-pod-container/configure-pod-configmap/#create-configmaps-from-literal-values[こちら] を参照)

source: ConfigSource Init
ja_jp: ConfigSource初期化

source: Configs all the way down
ja_jp: 設定の全貌

source: Configuration
ja_jp: 設定

source: Configuration Cache Compatibility
ja_jp: 設定キャッシュの互換性

source: Configuration Default Values
ja_jp: 設定デフォルト値

source: Configuration Example
ja_jp: 設定例

source: Configuration Groups
ja_jp: 設定グループ

source: Configuration Key
ja_jp: 設定キー

source: Configuration Keys
ja_jp: 設定キー

source: Configuration Maps
ja_jp: 設定マップ

source: Configuration Metadata
ja_jp: 設定メタデータ

source: Configuration Profiles allow for multiple configurations in the same file or separate files and select between them via a profile name.
ja_jp: 設定プロファイルでは、同じファイルまたは個別のファイルで複数の設定を行い、プロファイル名を使用してそれらから選択できます。

source: Configuration Properties Naming Strategies
ja_jp: 設定プロパティーの命名戦略

source: Configuration Properties to Deny access
ja_jp: アクセスを拒否する設定プロパティー

source: Configuration Reference
ja_jp: 設定リファレンス

source: Configuration Reference Documentation
ja_jp: 設定リファレンスドキュメント

source: Configuration Reference Guide
ja_jp: 設定リファレンスガイド

source: Configuration Reference for Hibernate ORM
ja_jp: Hibernate ORM の設定リファレンス

source: Configuration Reference for Hibernate Reactive
ja_jp: Hibernate Reactive の設定リファレンス

source: Configuration Reference for Hibernate Search Standalone
ja_jp: Hibernate Search Standalone の設定リファレンス

source: Configuration Reference for Hibernate Search with Hibernate ORM
ja_jp: Hibernate ORM を使用する Hibernate Search の設定リファレンス

source: Configuration Root Phases
ja_jp: 設定ルートフェーズ

source: Configuration Roots
ja_jp: 設定ルート

source: Configuration Value types
ja_jp: 設定値の型

source: Configuration With Origins (Experimental)
ja_jp: Origins を使用した設定 (実験的)

source: Configuration and Providers
ja_jp: 設定とプロバイダー

source: Configuration applicability
ja_jp: 設定の適用範囲

source: Configuration authorization checks are executed before any annotation-based authorization check is done, so both checks have to pass for a request to be allowed. This means you cannot use `@PermitAll` to open up a path if the path has been blocked using `quarkus.http.auth.` configuration. If you are using JAX-RS you may want to consider using the `quarkus.security.jaxrs.deny-unannotated-endpoints` or `quarkus.security.jaxrs.default-roles-allowed` to set default security requirements instead of HTTP path level matching, as these properties can be overridden by annotations on an individual endpoint.
ja_jp: 設定の認可チェックは、アノテーションベースの認可チェックが行われる前に実行されるため、リクエストを許可するには両方のチェックが通る必要があります。つまり、 `quarkus.http.auth.` の設定でパスがブロックされている場合、 `@PermitAll` を使ってパスを開くことはできません。JAX-RSを使用している場合は、HTTPパスレベルのマッチングではなく、 `quarkus.security.jaxrs.deny-unannotated-endpoints` または `quarkus.security.jaxrs.default-roles-allowed` を使用してデフォルトのセキュリティ要件を設定することを検討するとよいでしょう。これらのプロパティは、個々のエンドポイント上のアノテーションによって上書きすることができるからです。

source: Configuration can be done directly in Dev UI via the assistant settings pane. You'll need:
ja_jp: 設定は、 Dev UI のアシスタント設定ペインから直接行えます。以下のものが必要になります:

source: Configuration documentation is generated from JavaDoc comments in Java source files.
ja_jp: 設定ドキュメントは、Javaソースファイル内のJavaDocコメントから生成されます。

source: Configuration expressions set with the `SecureField.rolesAllowed` property are validated during application startup even when the `@io.quarkus.resteasy.reactive.jackson.DisableSecureSerialization` annotation is used.
ja_jp: `SecureField.rolesAllowed` プロパティーで設定された設定式は、 `@io.quarkus.resteasy.reactive.jackson.DisableSecureSerialization` アノテーションが使用されている場合でも、アプリケーションの起動時に検証されます。

source: Configuration files;
ja_jp: 設定ファイル。

source: Configuration for a mailer named `aws`.
ja_jp: `aws` という名前のmailerの設定 .

source: Configuration for a mailer named `sendgrid`.
ja_jp: `sendgrid` という名前のmailerの設定。

source: Configuration for the Kafka connector outgoing channels is similar to that of incoming:
ja_jp: Kafka コネクターの送信チャネルの設定は、受信の設定と似ています。

source: Configuration for the default mailer.
ja_jp: デフォルトのmailerの設定。

source: Configuration from a project's `application.properties`, `application.yaml` and `application.yml` files, as well as a project's `application-prod.properties`, `application-prod.yaml` and `application-prod.yml` files
ja_jp: プロジェクトの `application.properties` 、 `application.yaml` 、 `application.yml` ファイル、およびプロジェクトの `application-prod.properties` 、 `application-prod.yaml` 、 `application-prod.yml` ファイルからの設定

source: Configuration in Quarkus is based on SmallRye Config, an implementation of the MicroProfile Config specification. All of the standard features of MP-Config are supported; in addition, there are several extensions which are made available by the SmallRye Config project as well as by Quarkus itself.
ja_jp: Quarkusの設定は、MicroProfile Config仕様の実装であるSmallRye Configに基づいています。MP-Configの標準機能はすべてサポートされています。さらに、SmallRye ConfigプロジェクトやQuarkus自体によって提供されているエクステンションもいくつかあります。

source: Configuration in Quarkus is based on https://smallrye.io/smallrye-config/Main/[SmallRye Config]. All features provided by https://smallrye.io/smallrye-config/Main/[SmallRye Config] are also available in Quarkus.
ja_jp: Quarkusの設定は、 link:https://smallrye.io/smallrye-config/Main/[SmallRye Config] をベースにしています。 link:https://smallrye.io/smallrye-config/Main/[SmallRye Config] で提供されるすべての機能は、Quarkusでも利用可能です。

source: Configuration is done through the usual `application.properties` file.
ja_jp: 設定は通常の `application.properties` ファイルから行います。

source: Configuration items with a primitive type (such as `int` or `boolean`) implicitly use a default value of `0` or `false`. The sole exception to this rule is the `char` type which does not have an implicit default value.
ja_jp: プリミティブタイプ (`int` や `boolean` など) の設定アイテムは、デフォルト値の `0` または `false` を暗黙的に使用します。この規則の唯一の例外は、暗黙のデフォルト値を持たない `char` タイプです。

source: Configuration key conflicts
ja_jp: 設定キーの競合

source: Configuration keys are normally derived from the field names that they are tied to. This is done by de-camel-casing the name and then joining the segments with hyphens (`-`). Some examples:
ja_jp: 設定キーは通常、関連付けられているフィールド名から取得されます。これは、名前の de-camel-casing を実行してから、セグメントをハイフン (`-`) で結合することによって行われます。以下はその例です。

source: Configuration mappings are strictly bound by configuration phase, and attempting to access a configuration mapping from outside its corresponding phase will result in an error. They dictate when its contained keys are read from the configuration, and when they are available to applications. The phases defined by `io.quarkus.runtime.annotations.ConfigPhase` are as follows:
ja_jp: 設定マッピングは設定フェーズによって厳密に制約されており、対応するフェーズ以外から設定マッピングにアクセスしようとするとエラーが発生します。設定マッピングは、その中に含まれるキーがいつ設定から読み出され、いつアプリケーションから利用できるようになるかを決定するものです。 `io.quarkus.runtime.annotations.ConfigPhase` で定義されているフェーズは次のとおりです：

source: Configuration metadata
ja_jp: 設定メタデータ

source: Configuration objects with phase `RUNTIME` or `BUILD_AND_RUNTIME_FIXED` can be injected into recorders via constructor injection. Just create a constructor that takes the configuration objects the recorder needs. If the recorder has multiple constructors you can annotate the one you want Quarkus to use with `@Inject`. If the recorder wants to inject runtime config but is also used at static init time then it needs to inject a `RuntimeValue<ConfigObject>`, this value will only be set when the runtime methods are being invoked.
ja_jp: フェーズ `RUNTIME` または `BUILD_AND_RUNTIME_FIXED` の設定オブジェクトは、コンストラクターインジェクションを介してレコーダーに注入できます。レコーダが必要とする設定オブジェクトを取得するコンストラクターを作成するだけです。レコーダに複数のコンストラクターがある場合は、Quarkus で使用するコンストラクターに `@Inject` でアノテーションを付けることができます。レコーダーがランタイム設定を注入したいが、静的初期化時にも使用される場合は、 `RuntimeValue<ConfigObject>` を注入する必要があります。この値は、ランタイムメソッドが呼び出されてた場合にのみ設定されます。

source: Configuration objects with phase `RUNTIME` or `BUILD_AND_RUNTIME_FIXED` can be injected into recorders via constructor injection. The constructor requires a parameter for each configuration object type. If the Configuration object type is declared to be in the `RUNTIME` phase, it must be wrapped in a `RuntimeValue<>` type.
ja_jp: フェーズが `RUNTIME` または `BUILD_AND_RUNTIME_FIXED` の設定オブジェクトは、コンストラクターインジェクションを介してレコーダーにインジェクトできます。コンストラクターには、各設定オブジェクト型に対応するパラメーターが必要です。設定オブジェクト型が `RUNTIME` フェーズであると宣言されている場合は、 `RuntimeValue<>` 型でラップする必要があります。

source: Configuration of Quarkus extensions is injection-based, using annotations.
ja_jp: Quarkus エクステンションの設定は、アノテーションを使用した挿入ベースです。

source: Configuration of coordination with outbox polling
ja_jp: アウトボックスポーリングとの連携の設定

source: Configuration of popular mail services is covered in xref:mailer-reference.adoc#popular[the reference guide].
ja_jp: 一般的なメールサービスの設定については、 link:mailer-reference.html#popular[リファレンスガイド] に記載されています。

source: Configuration options
ja_jp: 設定オプション

source: Configuration options with *absolute* path values that begin with a user home directory are, by default, transformed with Unix home directory alias '~' replacing the user home directory part and using `/` as a path element separator.
ja_jp: ユーザーのホームディレクトリーで始まる *絶対* パス値を持つ設定オプションは、デフォルトでは、ユーザーのホームディレクトリー部分を Unix ホームディレクトリーエイリアス '~' に置き換え、パス要素の区切り文字として `/` を使用して変換されます。

source: Configuration prefix
ja_jp: 設定プレフィックス

source: Configuration properties not configurable in configuration files (non-serializable) is noted in the column `Config file`.
ja_jp: 設定ファイルで設定できない (シリアライズできない) 設定プロパティーは、 `Config file` 列にその旨が記載されています。

source: Configuration properties specified via `quarkus.quarkusBuildProperties` or via the Quarkus `application.*` configuration files are all considered as Gradle task inputs, in other words: every change in these files causes a rebuild.
ja_jp: `quarkus.quarkusBuildProperties` または Quarkus `application.*` 設定ファイルを介して指定された設定プロパティーは、すべて Gradle タスク入力とみなされます。つまり、これらのファイルを変更するたびにリビルドが実行されます。。

source: Configuration properties to deny access
ja_jp: アクセスを拒否するための設定プロパティ

source: Configuration property
ja_jp: 設定プロパティ

source: Configuration property conflicts
ja_jp: 設定プロパティの競合

source: Configuration property^
ja_jp: 設定プロパティー^

source: Configuration reference
ja_jp: 設定リファレンス

source: Configuration reference documentation
ja_jp: 設定リファレンスドキュメント
